[
  {
    "name": "Mark C.",
    "location": "San Francisco, CA",
    "date": "2025-11-07",
    "text": "Fantastic experience! Ilya responded quick to my text message, arrived on time for our appointment, quickly diagnosed the problem, and explained the situation to me very clearly. Also a fair price!"
  },
  {
    "name": "Matt L.",
    "location": "Clinton Hill, Brooklyn, NY",
    "date": "2025-09-10",
    "text": "I had an LG washer problem. Eli was available quickly, had a narrow service window (just 2 hours!), was economical, and actually fixed the problem."
  },
  {
    "name": "Roger S.",
    "location": "Manhattan, NY",
    "date": "2025-03-21",
    "text": "Our 10-year old LG washer gave out yesterday and I began an internet search for a repair service. Of the 3 servicers I called, Eli was the only one who: (i) asked what error code was showing (and knew what it meant), (ii) asked the model number of the machine, (iii) confirmed he had the part available, and (iv) gave me a firm (and I think fair) price. Plus, entirely on his own, he asked about building insurance requirements (I had forgotte"
  },
  {
    "name": "Michael R.",
    "location": "Manhattan, NY",
    "date": "2025-05-22",
    "text": "I dread dealing with contractors.\n\nThis was a perfect experience. Eli was brilliant!!!!\n\nSame day repair.\nGreat guy.\nPunctual.\nSolved the problem.\nHonest and very fair pricing.\n\nWanted to tell the world!\n\nThanks Eli"
  },
  {
    "name": "Phoebe C.",
    "location": "New York, NY",
    "date": "2025-08-06",
    "text": "Service is great. After contacting him , he was available to stop by at my preferred date and time . On time and efficient . He definitely know his work"
  },
  {
    "name": "Michelle T.",
    "location": "New York, NY",
    "date": "2024-07-22",
    "text": "Knowledgable and quick! They were able to send out a repair person within three days of my request. Eli was super quick to find the issue with my Bosch dryer and replace a broken part in 30 minutes. He gave me advice on how to avoid it breaking in the future.\n\nHe was even kind enough to ask if I had any other issues with my other appliances. I mentioned something in my fridge that he quickly solved at no extra cost.\n\nWould work with this team ag"
  },
  {
    "name": "Jonathan W.",
    "location": "Brooklyn, NY",
    "date": "2025-08-07",
    "text": "I needed a dishwasher and an oven fixed. Ely did a great job, fixed them both in under an hour. I recommend."
  },
  {
    "name": "David B.",
    "location": "Manhattan, New York, NY",
    "date": "2025-05-01",
    "text": "5 stars -- Expert service on high-end appliances\n\nIlya was fantastic. I'm in a condo in the Lower East Side of Manhattan and had several higher-end appliances that needed servicing -- Bosch oven, cooktop, and dishwasher, a Liebherr fridge/freezer, and an LG washer/dryer.\n\nOther techs had quoted me outrageous numbers or made the issues seem way more complicated than they really were. Ilya came in, diagno"
  },
  {
    "name": "Alison C.",
    "location": "Astoria, NY",
    "date": "2025-03-03",
    "text": "Was able to get a quote and set up an appointment via Yelp, which was really helpful. It was a great experience--arrived early and had the part I needed, when it turned out the part I had ordered was incorrect. And now my washer/dryer is working again!! Thank you!!"
  },
  {
    "name": "Scott K.",
    "location": "Brooklyn, NY",
    "date": "2025-04-12",
    "text": "The dishwasher broke in my rental unit. They were able to come out next day and the following day the problem was fixed. They also communicated with my tenants to find a time that worked for them.\n\nI really appreciated how quick and easy they made the whole process for me and my tenant. I also feel they were very honest about the advice they gave me when talking about if it was best to fix the issue vers"
  },
  {
    "name": "Vanessa H.",
    "location": "Philadelphia, PA",
    "date": "2024-08-30",
    "text": "Eli is awesome! Amazingly quick response to my inquiry and came the next day to take a look at my dishwasher. I need to get a new one but he patiently explained the exact issue and costed out a new one vs a repair. This is the sort of person you can trust."
  },
  {
    "name": "Grace K.",
    "location": "Manhattan, NY",
    "date": "2025-03-17",
    "text": "I've used this company twice and recommend them highly! Ilya is always on time, explains what he is doing and is very professional and polite."
  },
  {
    "name": "Alice L.",
    "location": "Manhattan, NY",
    "date": "2024-02-05",
    "text": "Great communication and quality of service. I messaged through yelp and immediately received a reply and reservation! Eli came and cleared a blockage that was stuck in the motor of our dishwasher. More than reasonable price. He even showed us how to maintain our bosch washer and dryer. Definitely recommend and will not hesi"
  },
  {
    "name": "Robyn W.",
    "location": "Manhattan, NY",
    "date": "2025-04-23",
    "text": "I would highly recommend Eli. He is very reliable and takes the time to explain the issue with my dishwasher. I would use him again in a heartbeat."
  },
  {
    "name": "Emily B.",
    "location": "New York, NY",
    "date": "2025-03-30",
    "text": "A neighbor recommended Residential Appliances Services and I'm so glad he did. Ilya did a wonderful job repairing my stove, He is so knowledgeable, pleasant, and prompt. I'll be using his services again, should the need arise."
  },
  {
    "name": "Amy L.",
    "location": "East Pennsboro Township, PA",
    "date": "2025-03-04",
    "text": "Excellent service! I was shocked that they were able to give me a same day appointment. Eli came exactly when he said he would and was really quick with communication. He explained what had gone wrong with my oven and fixed it immediately for a fair price. Highly recommended. I will definitely use them again."
  },
  {
    "name": "Christopher C.",
    "location": "Glen Head, NY",
    "date": "2024-11-12",
    "text": "Great company. I called them over to service my Summit oven and they spent 20-30 minutes trying to figure out the issue. He determined that I needed to call the actual company itself and did not charge me. Honest people - would recommend for sure."
  },
  {
    "name": "Alex B.",
    "location": "Palm Desert, CA",
    "date": "2024-06-22",
    "text": "Eli at Residential was fantastic and answered all of my questions in literally 5 minutes or less from the time that I asked them here on YELP. He has some real expertise and experience in this industry and was able to get us going in the right direction immediately, more or less.\n\nThank you!"
  },
  {
    "name": "John D.",
    "location": "Manhattan, NY",
    "date": "2024-10-04",
    "text": "Great service and quick turnaround. Arrived on time and were courteous/responsive at all times."
  },
  {
    "name": "Josh C.",
    "location": "Manhattan, NY",
    "date": "2023-04-10",
    "text": "A broken appliance is one of the most stressful things available. My Bosch dryer broke and I called bosch. They were not very helpful and repairs could be very costly. I checked around a few places and these guys were the most transparent, responsive and knowledgeable.\n\nThey were able to do same day appointments, had COIs ready, and were very polite. Eli came on time, took of shoes, cleaned up after his work. Replaced my drain pump quickly. I was wo"
  },
  {
    "name": "Erik L.",
    "location": "Manhattan, NY",
    "date": "2024-06-24",
    "text": "Prompt, professional and outstanding service. Eli was upfront about costs and was a pleasure to deal with. Thank you!"
  },
  {
    "name": "Sarah J.",
    "location": "Brooklyn, NY",
    "date": "2024-06-04",
    "text": "Great service! Eli gave me an estimate and scheduled to come the very next day. He explained everything he did, and gave advice about keeping it running well. Washer is fixed. And price was right."
  },
  {
    "name": "Adrian K.",
    "location": "Manhattan, New York, NY",
    "date": "2024-05-29",
    "text": "Amazing service. Quick to respond issue fixed in 20 mins. They replaced the components and gave some tips to how to maintain the washer better"
  },
  {
    "name": "Tony S.",
    "location": "New York, NY",
    "date": "2023-06-17",
    "text": "My Bosch dishwasher needed repair, and Residential Appliance Services knew exactly what needed to be done, gave me a reasonable quote, and fixed the issue all within 2 days of requesting the service. I was shown what was wrong and was given recommendations for regular maintenance. They're super responsive and professional. Highly recommend!"
  },
  {
    "name": "Izel N.",
    "location": "New York, NY",
    "date": "2023-02-28",
    "text": "Great service! Responded fast, arrived on time and fixed issue quickly on a broken washing machine. highly recommend"
  },
  {
    "name": "Albert L.",
    "location": "Astoria, NY",
    "date": "2022-11-05",
    "text": "Eli came promptly on time for his appointment. I called him the night before and was very grateful that he could squeeze me in. Eli arrived and promptly serviced my two stoves. He explained everything he did and was very courteous and professional. I will definitely call him again. Highly recommended. Thank you, Eli, for taking such good care of me and my family."
  },
  {
    "name": "Gigi D.",
    "location": "Midtown East, Manhattan, NY",
    "date": "2022-07-06",
    "text": "Residential Appliance was brilliant. I had just gotten my dryer repaired when my washing machine's motor gave out. I was at my wits end and decided to turn to Yelp. I'm so glad I did. RAS not only messaged me straight away, but I had an appointment for the following morning (this was pure luck I'm sure). The technician sent for the repair was prompt, courteous, super knowledgeable, and he had the part I needed for the repair. An hour later my washi"
  },
  {
    "name": "Bria W.",
    "location": "Burbank, CA",
    "date": "2023-10-19",
    "text": "Eli was prompt in answering my call for service on my Bosch 300 Series Dryer. He continued to text me throughout the day answering all my questions and fixed my dryer sensor the next day. Very easy process and great customer service. Especially for those with little time!"
  },
  {
    "name": "Curly S.",
    "location": "Brooklyn, NY",
    "date": "2024-03-15",
    "text": "Getting an appointment was fast and easy and I was surprised when Eli himself picked up my call. He was able to come that very evening while the official Bosch serviceman told meet earliest would be a week. Once he assessed what was ailing my Bosch 500 series washer, he gave a quote before proceeding with the work. What we didn't know was there was a secondary issue after the first issue was fixed. He tirelessly worked until he got the machine wo"
  },
  {
    "name": "Michael B.",
    "location": "New York, NY",
    "date": "2022-05-02",
    "text": "Amazing. Arrived on time and spent over an hour trying to fix my refrigerator. He could not repair it - not his fault - it is a built in and has to be done from the back, a much bigger job. He tried...A LOT! But just not possible. As a result, he did not charge me.\n\nEli was extremely professional and polite and kept me posted on what he was doing, why, and why it could not be fixed. I was so impressed and will definitely use him if I ever need a r"
  },
  {
    "name": "Yuri O.",
    "location": "Manhattan, NY",
    "date": "2023-04-29",
    "text": "Upon requesting a quote, the owner without asking any flat rate ( that's what repair usually do to me) asked my very old Bosch model and the problem. He gave me a link saying the parts are not available. And told me what to do next without charging me anything . Thank you very much such a warm helpful person"
  },
  {
    "name": "Magic J.",
    "location": "Manhattan, NY",
    "date": "2022-04-27",
    "text": "Unparalleled professionalism. Eli came over to look at our broken Bosch dishwasher. He was extremely up front about pricing, did his work quickly, and maintained a level of friendliness that I find uncommon in New York. After two visits (diagnostic + trial replacement of two potentially malfunctioning parts), it was unfortunately determined that the cost of the necessary repair would've approached that of a new dishwasher, so Eli simply advised us"
  },
  {
    "name": "Candace C.",
    "location": "Upper West Side, New York, NY",
    "date": "2024-05-31",
    "text": "Like everyone else here, I cannot recommend Eli/Residential Appliance Services enough. My washing machine (Bosch) wasn't draining properly, and I'd tried several different repair companies (over many, many weeks), but most of them didn't respond or couldn't meet my apartment building's stringent insurance requirements. Eli was incredibly responsive, easy to work with, organized, kind, and could provide all the right insurance. On the day of, Eli s"
  },
  {
    "name": "Leo Y.",
    "location": "Pittsburgh, PA",
    "date": "2023-05-24",
    "text": "Very quick, informative and professional. I needed to fix my washer not draining, he knew the exact issue and it was fixed. I would recommend to anyone and also use them for future appliance repair needs (if I need one , hopefully not). Thank you very much!!!!\n\nWasher dryer combo"
  },
  {
    "name": "Jcw C.",
    "location": "Brooklyn, NY",
    "date": "2023-05-13",
    "text": "Called these guys out to take my phone Ben apart and remove some glass that had fallen down by the heat source when a glass dish burst unexpectedly. They showed up promptly answered my questions and took care of the oven. Will definitely use again if needed."
  },
  {
    "name": "Mariana S.",
    "location": "New York, NY",
    "date": "2023-03-02",
    "text": "I reached out to Ilya regarding a fridge repair around midnight and got a response by the time I woke up. He was prompt with his answer, gave realistic expectations and set a fair price for the diagnostics visit. He arrived exactly on time, was respectful of my space. He immediately diagnosed my issue and was very transparent on my choices to fix it myself or have him do it as well as the price on both options. I am incredibly impressed with Ilya"
  }
]
